In [2]:
import pandas as pd

**Задание 1**

1. Используйте файл с оценками фильмов ml-latest-small/ratings.csv.
Посчитайте среднее время жизни пользователей, которые выставили более 100 оценок.
Под временем жизни понимается разница между максимальным и минимальным значением
столбца timestamp для данного значения userId.

In [4]:
data_movies = pd.read_csv(r'D:\Python\12_pandas_advanced!!!!!!\ratings.csv')

In [5]:
data_movies.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [76]:
type(data_movies['timestamp'][1])

numpy.int64

In [62]:
new_data = data_movies.groupby('userId').agg(['min', 'max', 'count'])['timestamp']

In [63]:
new_data['diff'] = new_data['max'] - new_data['min']

In [69]:
data_fan = new_data[new_data['count'] >= 100]

In [77]:
# data_fan.head()

In [74]:
data_fan['diff'].mean()

44190282.03225806

**Задание  2**

2. Дана статистика услуг перевозок клиентов компании по типам (см. файл с кодом занятия).
   Необходимо сформировать две таблицы:
- таблицу с тремя типами выручки для каждого client_id без указания адреса клиента
- аналогичную таблицу по типам выручки с указанием адреса клиента

Обратите внимание, что в процессе объединения таблиц данные не должны теряться.

К домашнему заданию, задача 2
Дана статистика услуг перевозок клиентов компании по типам:

rzd - железнодорожные перевозки
auto - автомобильные перевозки
air - воздушные перевозки
client_base - адреса клиентов

In [6]:
rzd = pd.DataFrame(
    {
        'client_id': [111, 112, 113, 114, 115],
        'rzd_revenue': [1093, 2810, 10283, 5774, 981]
    }
)
rzd

   client_id  rzd_revenue
0        111         1093
1        112         2810
2        113        10283
3        114         5774
4        115          981

In [7]:
auto = pd.DataFrame(
    {
        'client_id': [113, 114, 115, 116, 117],
        'auto_revenue': [57483, 83, 912, 4834, 98]
    }
)
auto

   client_id  auto_revenue
0        113         57483
1        114            83
2        115           912
3        116          4834
4        117            98

In [8]:
air = pd.DataFrame(
    {
        'client_id': [115, 116, 117, 118],
        'air_revenue': [81, 4, 13, 173]
    }
)
air

   client_id  air_revenue
0        115           81
1        116            4
2        117           13
3        118          173

In [9]:
client_base = pd.DataFrame(
    {
        'client_id': [111, 112, 113, 114, 115, 116, 117, 118],
        'address': ['Комсомольская 4', 'Энтузиастов 8а', 'Левобережная 1а', 'Мира 14', 'ЗЖБИиДК 1', 
                    'Строителей 18', 'Панфиловская 33', 'Мастеркова 4']
    }
)
client_base

   client_id          address
0        111  Комсомольская 4
1        112   Энтузиастов 8а
2        113  Левобережная 1а
3        114          Мира 14
4        115        ЗЖБИиДК 1
5        116    Строителей 18
6        117  Панфиловская 33
7        118     Мастеркова 4

In [10]:
new_base = client_base.merge(rzd, how='left').merge(auto, how='left').merge(air, how='left')
new_base

   client_id          address  rzd_revenue  auto_revenue  air_revenue
0        111  Комсомольская 4       1093.0           NaN          NaN
1        112   Энтузиастов 8а       2810.0           NaN          NaN
2        113  Левобережная 1а      10283.0       57483.0          NaN
3        114          Мира 14       5774.0          83.0          NaN
4        115        ЗЖБИиДК 1        981.0         912.0         81.0
5        116    Строителей 18          NaN        4834.0          4.0
6        117  Панфиловская 33          NaN          98.0         13.0
7        118     Мастеркова 4          NaN           NaN        173.0

In [11]:
new_base2 = new_base.drop(new_base.columns[[1]], axis='columns')
new_base2

   client_id  rzd_revenue  auto_revenue  air_revenue
0        111       1093.0           NaN          NaN
1        112       2810.0           NaN          NaN
2        113      10283.0       57483.0          NaN
3        114       5774.0          83.0          NaN
4        115        981.0         912.0         81.0
5        116          NaN        4834.0          4.0
6        117          NaN          98.0         13.0
7        118          NaN           NaN        173.0

**Задание 3**

3. В задаче сквозной аналитики вам предоставили данные по местоположению пользователей.
   Т. е. для каждого user_id известна последовательность координат (широта/долгота), 
   когда они требовались приложению для полноценной работы.
   Как бы вы добавили эти сведения в таблицу визитов и покупок? Для составления ответа можно использовать вопросы:
   - У каждого пользователя известен набор координат. А для связывания с визитом или фактом покупки скорее всего 
     потребуется одно-два числа. Как их получить?
   - Наборы координат одного и того же пользователя могут быть значительно удалены друг от друга. 
     Как это отразится на вопросе расчетах пункта 1?
   - Какие дополнительные признаки можно получить из координат? Ведь это просто числа, которые сами по себе мало что дают.

In [ ]:
Нужно извлечь широту и долготу из последовательности геокоординат и создать 2 столбца с широтой и долготой.
Использовать полное соединение в запросе. 
Дополнительные параметры, которые хотелось бы получить, район Москвы. Как сделать, не знаю. По улицам возникает проблема
в определении района, так как разные дома одной улицы находятся в разных районах, по геокоординатам этой проблемы быть не должно.